### CLASE 05 12/27/2024: Operaciones con ARRAYS y DATAFRAMES xa usar en el PROYECTO PRE-WORK

In [4]:
import pandas as pd # libreria para manipulacion de datos mediante data frames
import numpy as np # libreria para manipulacion de datos mediantes matrices
import matplotlib.pyplot as plt # libreria para manipulacion de graficos
# import seaborn as sns, pero esa libreria no esta en requirements asi que no la ponemos no la vamos a usar.

#a continuacion vamos a hacer un arreglo de datos

In [5]:
myarray = np.array([1,2,3])
myarray
# este es un vector de datos homogeneos, en tipo de datos, unidades, 
# y tema de observacion. 
# Si metemos texto en algun lado, todo se va a transformar en texto.
# estos vectores representan algo, ejemplo, estaturas, kilogramos, 
# ventas de los ultimos años, pero no debemos mezclar estas unidades. 
# para eso genero vectores distintos.

array([1, 2, 3])

In [6]:
# Para crear un data frame, hay dos formas.
# 1ro. Creando un Diccionario 
# 2do. lo hacemos mediente una lista de datos
# Cada Key es un nombre de columna. 

df = pd.DataFrame({"name": ["ana", "Peter"], "age": [23, 34]})
df

    name  age
0    ana   23
1  Peter   34

In [7]:
# Vamos a entender como ver la info dentro de un data frame. 
# metodo info nos trae informacion de ese dataframe.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [8]:
# Se ve que no hay datos nullos
# En pandas al tipo de dato texto, le llaman "object"
# int64 es un entero grande como 1.000.000
# La ultima linea nos muestra la memoria utilizada. Recordar que python trabaja 
# sobre la memoria ram, o sea que esos 164 bytes son sobre la ram. 
# Siempre estar atentos al tamaño de memoria del objeto en data frame.
# Ejemplo, 1 mes de datos de ventas puede pesar un tera byte

In [9]:
# Ahora vamos a agregar una columna con datos nulos. 
# para poner un dato nulo de tipo numerico, se pone np.nan. 
# Esta es la representacion numerica de la ausencia de datos. NaN = Not a Number
# La ausencia de datos es un dato, y es algo comun.
df["salary"] = [1000, np.nan]
df

    name  age  salary
0    ana   23  1000.0
1  Peter   34     NaN

In [10]:
# Las dimenciones de un data frame se mide por su cantidad de filas y columnas. En este caso vemos 2 filas y 3 columnas.
# para saber el tamaño del data frame uso el metodo shape, que retornara primero la cantidad de filas y luego la cantidad de columnas. 
# eSTO ME DEVUELVE UNA TUPLA(coleccion de datos dentro de un parentesis), QUE ES INMUTABLE Y ADEMAS SE PUEDE LLAMAR POR INDICES.
# Recordar que en python el indice empieza en 0
df.shape

(2, 3)

In [11]:
# Para traer el primer elemento de la tupla
df.shape[0]

2

In [12]:
# Para traer el segundo elemento de la tupla
df.shape[1]

3

In [13]:
#Para traerme una fila, hago:
df["name"]
# en este caso python se esta trayendo el vector, 
# (pandas lo llama series a los vectores)

0      ana
1    Peter
Name: name, dtype: object

In [14]:
# Para verlo como matriz, (como si fuera una data frame de una sola columna),
# hacemos esto:
df[["name"]]

    name
0    ana
1  Peter

In [15]:
# El primero es una serie (un vector), y 
# el segundo es un dataframea (una matriz 2x1)

In [16]:
df[["name","salary"]] # estoy llamando una matriz 2x2 (dataframe 2x2)

    name  salary
0    ana  1000.0
1  Peter     NaN

In [17]:
# a las columnas tambien podemos aplicarles metodos, como por ejemplo, 
# para calcular el maximo, el minimo
df["age"].mean() # mean = minimo

np.float64(28.5)

In [18]:
df["age"].max() 
# valor maximo de la columna "age". 
# usar "min" para traerme el minimo

np.int64(34)

In [19]:
# Para ordenar la tabla
df.sort_values(by="age", ascending = False) 
# aca estoy ordenando por los valores de la columna age. que por defecto ordena de menor a mayor. A menos que pongamos ascending false.
# Si quisieramos, es posible ordenar por mas de una columna. En este caso no tiene sentido, ya que salario no tiene mas de un dato.

    name  age  salary
1  Peter   34     NaN
0    ana   23  1000.0

In [20]:
df.sort_values(by=["age", "salary"])

    name  age  salary
0    ana   23  1000.0
1  Peter   34     NaN

In [21]:
# vamos a abrir un nuevo dataframe abriendo un libro de excel para el que 
# necesitamos instalar una libreria: python -m pip install openpyxl

In [22]:
df = pd.read_excel('https://github.com/datagy/mediumdata/raw/master/sample_pivot.xlsx')
df

          Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   18.0    306
1   2020-09-23  North  Children's Clothing   14.0    448
2   2020-04-02  South     Women's Clothing   17.0    425
3   2020-02-28   East  Children's Clothing   26.0    832
4   2020-03-19   West     Women's Clothing    3.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   35.0    735
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   13.0    208
998 2020-08-23  South     Women's Clothing   17.0    493
999 2020-08-17  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]

In [23]:
# Date es una columna del tipo fecha. La fecha esta siendo representada en el formato yyyy-mm-dd
# La segunda columna es del tipo texto
# La tercera es del tipo categorizaciones... Grupos de cosas
# Unit son cantidades, y como hay un NaN, lo python lo interpreta todo como flotante.
# La columna sales es moneda
# Veamos que nos dice el metodo info:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   datetime64[ns]
 1   Region  1000 non-null   object
 2   Type    1000 non-null   object
 3   Units   911 non-null    float64
 4   Sales   1000 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 39.2+ KB

In [24]:
# para el mundo de data scientst, cada fila se le llama "OBSERVACION".
# Cada fila es una observacion. En este caso tenemos un data frame de 
# 1000 observaciones, y de tamaño 1000x5

In [25]:
# Para ver de forma aleatoria, una muestra de mis datos usando el metodo sample (Recordar que es al azar). 
# La ventaja es que podemos tener una mejor vistazo del tipo de datos que hay. Pareciera en mi caso, que las observaciones corresponden a un solo año
# La columna region, nos muestra que en principio solo hay 4 regiones.
# De igual forma type. Pareciera que son 3 categorias.
# Unidades, en la muestra de otro estudiante se ven dos unidades con Nan y Ventas. otra vez pongo df.info para ver cuantos nulos tengo. Alli vemos que la columna  units tiene 911 valores not null. Asi que hay 89 nulos.
df.sample(10)

          Date Region                 Type  Units  Sales
236 2020-04-18   East     Women's Clothing    6.0    759
258 2020-05-17  South       Men's Clothing   24.0    266
171 2020-10-26   East     Women's Clothing    4.0    442
759 2020-10-16   East     Women's Clothing   14.0    308
263 2020-05-26   East       Men's Clothing   33.0    486
247 2020-04-07   West  Children's Clothing   22.0    990
344 2020-03-01   West       Men's Clothing    8.0    345
599 2020-03-27  South       Men's Clothing   11.0    300
305 2020-01-17  South     Women's Clothing   12.0    208
300 2020-12-09   East     Women's Clothing   26.0    140

In [26]:
# Por esto siempre es importante que lo primero que se haga en un dataframe es 
# aplicar metodo info, para ver tipos de datos y nulos
# y metodo sample para tener un pantallazo general de mis datos.

In [27]:
# Si quisiera asegurarme la cantidad de valores distintos y unicos que tiene 
# una columna, uso el metodo value_counts
df["Region"].value_counts()

Region
East     411
North    316
South    137
West     136
Name: count, dtype: int64

In [28]:
df["Type"].value_counts()

Type
Women's Clothing       424
Men's Clothing         291
Children's Clothing    285
Name: count, dtype: int64

In [29]:
#  Vamos a hacer una transformacion, convirtiendo el tipo de datos de la columna  
#  region y type en categorias. Esto hace que el codigo corra mas rapido. 
#  Siempre que pueda transformar texto (object) a categorical, hacerlo.
# "pd.categorical" es una funcion que convierte la columna en categorical. 

df["Region"] = pd.Categorical(df["Region"])
df["Type"] = pd.Categorical(df["Type"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   datetime64[ns]
 1   Region  1000 non-null   category
 2   Type    1000 non-null   category
 3   Units   911 non-null    float64
 4   Sales   1000 non-null   int64
dtypes: category(2), datetime64[ns](1), float64(1), int64(1)
memory usage: 25.8 KB

In [30]:
# Para estar seguros de la consistencia de los datos, es que debemos darle un vistaso 
# a las estadisticas basicas de nuestro dataframe.
# Por ejemplo en este caso, le vamos a pedir que nos haga una descripcion 
# solamente de los datos numericos:
df.describe(include="number")

            Units        Sales
count  911.000000  1000.000000
mean    19.638858   427.254000
std      9.471309   253.441362
min      3.000000    33.000000
25%     12.000000   224.000000
50%     20.000000   380.000000
75%     28.000000   575.000000
max     35.000000  1155.000000

In [31]:
# Aca entonces vemos las estadisticas basicas de las columnas numericas.
# Count: Nos dice la cantidad de valores no nulos que hay en cada columna
# Mean: Media. Promedio Aritmetico. La suma de todos los valores dividio la cantidad de valores.
# std:
# min: Nos da el valor minimo de cada columna 
# 25%:
# 50%:
# 75%:
# max: Nos da el valor maximo de cada columna

In [32]:
# Esto nos ayuda a tener un panorama de la consitencia de nuestro datos.
# Por ejemplo, si yo tuviera una columna que fuera la estatura, y los datos de esa columna van desde 1.50 mts hasta los 2.70 mt,
# nos dariamos cuenta a simple vista que la columna tiene datos incorrectos, inconsistentes.
# Entonces, el rango en el que se mueven los datos, es mi principal imput, ya que tiene que tener sentido. 
# Si dejaramos este dato, una de las cosas que estariamos afectando son los promedios.

In [33]:
# Ahora haremos una descripcion de los datos no numericos, es decir de los 
# datos categoricos
df.describe(include="category")

       Region              Type
count    1000              1000
unique      4                 3
top      East  Women's Clothing
freq      411               424

In [34]:
# Count: nos muestra la cantidad valores que hay en cada columna
# unique: nos dice la cantidad de valores unicos de cada columna
# top: nos dice el valor que aparece mas veces en cada columna. Para la columna Region, "east" es el valor que aparece mas veces.
# freq: nos dice la cantidad de repeticiones con las que aparece el valor mas frecuente. en la columna Region, East es el valor que mas aparece con 411 repeticiones. 
# Con esto ya veriamos que la region East pesa un 40% aprox.

In [35]:
# Veamos ahora cuanto seria el total de las ventas en ese dataframe. 
# para lo cual voy a utilizar el metodo sum.
suma = df["Sales"].sum()
suma

np.int64(427254)

####TIP: Los f sting, permiten combinar texto y variabes en una misma linea.

####TIP: Las Mayusculas y Minusculas son muy importantes!

In [36]:
print(f"El total de las ventas del dataframe es: {suma}")

El total de las ventas del dataframe es: 427254

In [37]:
# Para hacer el resultado mas legible, le agregamos separador de miles, (la coma sera el que usaremos por convencion), 
# colocando lo siguiente luego del nombre de mi variable.
# :,
print(f"El total de las ventas del dataframe es: {suma:,}")

El total de las ventas del dataframe es: 427,254

In [38]:
# Ahora para ver el promedio total de las unidades, usariamos el metodo mean.
promedio = df["Units"].mean()
promedio

np.float64(19.63885839736553)

In [39]:
# Ahora le agrego texto a mi resultado:
print(f"El promedio total de las unidades vendidas en mi dataframe es: {promedio}")

El promedio total de las unidades vendidas en mi dataframe es: 19.63885839736553

In [40]:
# Para que el resultado sea mas legible, voy a dejar el promedio solo con dos decimales colocando lo siguiente luego del nombre de mi variable
# :.2f
# Esto me habilita solo dos lugares despues de la coma.
print(f"El promedio total de las unidades vendidas en mi dataframe es: {promedio:.2f}")

El promedio total de las unidades vendidas en mi dataframe es: 19.64

In [41]:
# Ahora quiero saber la cantidad de ventas pero por Region. Asi que veremos METRICAS POR AGRUPAMIENTO.
# Es importante saber, que cuando agregamos por variables categoricas, como region en este caso, podria pasar que uno de los valores no este, pero la categoria si existe, generando problemas.
# Para evitar este problema, debemos colocar lo siguiente luego del nombre de mi categoria: ,observed=False
df.groupby("Region" ,observed=False)["Sales"].sum()

Region
East     167763
North    138700
South     59315
West      61476
Name: Sales, dtype: int64

In [42]:
# Calculemos el PROMEDIO DE UNIDADES POR REGION:
df.groupby("Region" , observed=False)["Units"].mean()

Region
East     19.732360
North    19.202643
South    20.423358
West     19.294118
Name: Units, dtype: float64

In [43]:
# Calculemos 3 AGREGACIONES: MEDIA, MAXIMO Y MINIMO: Usamos el metodo agg, y le damos como parametro los calculos que quiero hacer.
df.groupby("Region", observed=False)["Sales"].agg({"mean", "min", "max"})

        min   max        mean
Region
East     36  1122  408.182482
North    42  1155  438.924051
South    48  1122  432.956204
West     33  1023  452.029412

In [44]:
# AHORA QUIERO SACAR UNA MUESTRA DE DATOS DE UNA REGION EN PARTICULAR. PARA ESTO APLICAREMOS FILTROS:
df[df["Region"]=="West"]

          Date Region                 Type  Units  Sales
4   2020-03-19   West     Women's Clothing    3.0     33
15  2020-11-26   West       Men's Clothing   27.0    864
21  2020-06-23   West     Women's Clothing   18.0    288
24  2020-06-18   West       Men's Clothing    5.0     70
30  2020-07-13   West  Children's Clothing   30.0    450
..         ...    ...                  ...    ...    ...
969 2020-07-20   West     Women's Clothing   25.0    442
970 2020-11-28   West     Women's Clothing   12.0    770
972 2020-09-21   West       Men's Clothing   35.0    437
985 2020-02-08   West       Men's Clothing   32.0    928
991 2020-11-17   West       Men's Clothing   27.0    486

[136 rows x 5 columns]

In [45]:
# AHORA QUIERO VER UNA MUESTRA DE DATOS DE LA REGION ESTE, PERO QUE SOLO SEA ROPA DE HOMBRE: FILTRO X DOS CONDICIONES
# Sintaxis: df[ (1er Condicion) & (2da Condicion) ], donde el & representa el and
df[(df["Region"]=="East") & (df["Type"]=="Men's Clothing") ],

(          Date Region            Type  Units  Sales
 12  2020-05-01   East  Men's Clothing   10.0    140
 14  2020-01-07   East  Men's Clothing   30.0    360
 26  2020-02-01   East  Men's Clothing   21.0    420
 28  2020-01-19   East  Men's Clothing    3.0     63
 34  2020-11-04   East  Men's Clothing   19.0    475
 ..         ...    ...             ...    ...    ...
 962 2020-08-13   East  Men's Clothing   32.0    132
 973 2020-10-04   East  Men's Clothing   35.0    350
 977 2020-10-20   East  Men's Clothing   32.0    928
 980 2020-03-20   East  Men's Clothing   14.0    238
 989 2020-05-04   East  Men's Clothing    6.0    108

 [122 rows x 5 columns],)

In [46]:
# AHORA QUIERO VER UNA MUESTRA DE LA REGION ESTE O NORTE. Pare esto debo filtrar usando el operador | que representa el OR
# Sintaxis: df[ (Condicion 1) | (Condicion 2) ]
df[(df["Region"]=="East") | (df["Region"]=="West") ],

(          Date Region                 Type  Units  Sales
 0   2020-07-11   East  Children's Clothing   18.0    306
 3   2020-02-28   East  Children's Clothing   26.0    832
 4   2020-03-19   West     Women's Clothing    3.0     33
 7   2020-03-25   East     Women's Clothing   29.0    609
 9   2020-11-03   East  Children's Clothing   34.0    374
 ..         ...    ...                  ...    ...    ...
 985 2020-02-08   West       Men's Clothing   32.0    928
 989 2020-05-04   East       Men's Clothing    6.0    108
 991 2020-11-17   West       Men's Clothing   27.0    486
 994 2020-10-18   East     Women's Clothing   19.0    399
 995 2020-02-11   East  Children's Clothing   35.0    735

 [547 rows x 5 columns],)

In [47]:
# AHORA, NECESITO AGREGARLE UNA UNIDAD A TODOS LOS VALORES DE LAS UNIDADES, YA QUE POR ERROR LOS VALORES ESTAN UNA UNIDAD ABAJO.
# PAra recordar los valores de las unidades imprimo mi dataframe
df

          Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   18.0    306
1   2020-09-23  North  Children's Clothing   14.0    448
2   2020-04-02  South     Women's Clothing   17.0    425
3   2020-02-28   East  Children's Clothing   26.0    832
4   2020-03-19   West     Women's Clothing    3.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   35.0    735
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   13.0    208
998 2020-08-23  South     Women's Clothing   17.0    493
999 2020-08-17  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]

In [48]:
# Ahora si le sumo uno
# Observacion: Si yo a un NaN le agrego uno, no cambia nada. Solo se afectan los valores numericos.
df["Units"] = df["Units"] + 1
df

          Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   19.0    306
1   2020-09-23  North  Children's Clothing   15.0    448
2   2020-04-02  South     Women's Clothing   18.0    425
3   2020-02-28   East  Children's Clothing   27.0    832
4   2020-03-19   West     Women's Clothing    4.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   36.0    735
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   14.0    208
998 2020-08-23  South     Women's Clothing   18.0    493
999 2020-08-17  North     Women's Clothing   26.0    300

[1000 rows x 5 columns]

In [49]:
# Ahora nos avisan que a todas las ventas de la region este, hay que restarles 1
# para esto debemos aplicar un FILTRO DE ASIGNACION
# Para ello debemos usar df.loc, donde loc en este caso quiere decir localizar
# Sintaxis: df.loc[fila,columna] loc se ubicara por fila y columna. por eso no lleva parentesis. es un index.

df.loc[ df["Region"]=="East", "Sales"] -= 1 
df
# Entonces, primero hice el filtro, y para la columna aplique el auto resto (-=)
# En este caso se esta ubicando por Filas de region este y tomando solo la columna Sales.

# RECORDAR!!!: Cuando debo modificar solo una parte del dataframe, siempre debo usar df.loc

          Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   19.0    305
1   2020-09-23  North  Children's Clothing   15.0    448
2   2020-04-02  South     Women's Clothing   18.0    425
3   2020-02-28   East  Children's Clothing   27.0    831
4   2020-03-19   West     Women's Clothing    4.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   36.0    734
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   14.0    208
998 2020-08-23  South     Women's Clothing   18.0    493
999 2020-08-17  North     Women's Clothing   26.0    300

[1000 rows x 5 columns]